1. 먼저 실습에 들어가기전 ....
- 머신러닝, 딥러닝, 빅데이터가 들어가게 해주세요.... : 많은 기업이 프로젝트를 진행하거나 업무기획을 할때 요구하던 대부분의 내용... 요즘에는 더할지도??? 
- 프로젝트 진행하던 사람도 실체는 알지 못하고 뜬구름 잡는 소리를 계속한다.... 
- 점점 많은 이들이 데이터 분석 자체보다는 이를 어떻게 활용할지에 대해 고민하는 것으로 보인다.
- 데이터 분석 자체가 아니라 '000를 위한 데이터 분석', '데이터분석을 통한 000 도출' 등의 표현이 더 적합해 보인다. 

2. 데이터분석
  1) 데이터분석을 진행할 효과적인 도구 : python
  2) 산업에 대한 이해

3. 파이썬 ; 언어를 배우기 위해서는 많이 듣고 말하는 과정이 언어에 필요한 것처럼, 코드를 많이 입력해보고 프로그래밍을 경험해보는 과정이 중요하다.
- 공부 목적보다는 실습이나 활용을 목적으로 책을 찾는 분들에게 적합한 책이다

In [1]:
t1 = "hp010-6262-2588"
print(t1)

t2 = t1.strip()
print(t2, '\n')

t3 = t2.replace('hp','H.P')
print(t3)

t4 = t3.replace('H.P','')
t4 = t4.split('-')
print(t4)

hp010-6262-2588
hp010-6262-2588

H.P010-6262-2588
['010', '6262', '2588']

## 02. 데이터 분석기초

In [2]:
import os 
os.getcwd()

'd:\\SNU\\실무파이썬\\직장인을 위한 데이터분석 실무 with 파이썬'

In [9]:
import pandas as pd
sample_1 = pd.read_excel('./datasalon-master/datasalon-master/02_개정판/2_Data_Analysis_Basic/files/sample_1.xlsx',
                         header = 1, skipfooter = 2, usecols = 'A:D')  
#header = 1 : 0번째 row는 제외, skipfooter = 2 ; 마지막 row의 2개 줄은 생략한다., usecols ; A부터 D까지의 columns을 사용한다.
print(sample_1.head(10),'\n')
print(sample_1.info())

  국적코드  성별    입국객수    전년동기
0  A01  남성  106320   85815
1  A01  여성  191436  125241
2  A31  남성     319     299
3  A31  여성      42      54
4  A18  남성  158912  124486
5  A18  여성  232943  163466

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
 3   전년동기    6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes
None

In [10]:
print(sample_1.describe())

                입국객수           전년동기
count       6.000000       6.000000
mean   114995.333333   83226.833333
std     98105.752006   68858.227184
min        42.000000      54.000000
25%     26819.250000   21678.000000
50%    132616.000000  105150.500000
75%    183305.000000  125052.250000
max    232943.000000  163466.000000

In [11]:
sample_1

  국적코드  성별    입국객수    전년동기
0  A01  남성  106320   85815
1  A01  여성  191436  125241
2  A31  남성     319     299
3  A31  여성      42      54
4  A18  남성  158912  124486
5  A18  여성  232943  163466

In [13]:
sample_1['국적코드']

0    A01
1    A01
2    A31
3    A31
4    A18
5    A18
Name: 국적코드, dtype: object

In [15]:
sample_1[['국적코드', '입국객수']]

  국적코드    입국객수
0  A01  106320
1  A01  191436
2  A31     319
3  A31      42
4  A18  158912
5  A18  232943

In [18]:
# 데이터 column 추가
sample_1['기준년월'] = '2019-11'
sample_1

  국적코드  성별    입국객수    전년동기     기준년월
0  A01  남성  106320   85815  2019-11
1  A01  여성  191436  125241  2019-11
2  A31  남성     319     299  2019-11
3  A31  여성      42      54  2019-11
4  A18  남성  158912  124486  2019-11
5  A18  여성  232943  163466  2019-11

In [20]:
#성별이 남성인 사람만 골라내서 출력.
condition = sample_1['성별'] == '남성'
condition

sample_1[condition]

  국적코드  성별    입국객수    전년동기     기준년월
0  A01  남성  106320   85815  2019-11
2  A31  남성     319     299  2019-11
4  A18  남성  158912  124486  2019-11

In [21]:
# 입국객 수 150,000 명 이상인 경우만 찾아보자
condition = (sample_1['입국객수']>= 150000)
sample_1[condition]

  국적코드  성별    입국객수    전년동기     기준년월
1  A01  여성  191436  125241  2019-11
4  A18  남성  158912  124486  2019-11
5  A18  여성  232943  163466  2019-11

In [30]:
#여기서 문자열 입력할 떄는 반드시 '' 따옴표 입력
conditions = (sample_1['성별'] == '남성') & (sample_1['입국객수']>=150000)
print(conditions, '\n')

sample_1[conditions]

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

  국적코드  성별    입국객수    전년동기     기준년월
4  A18  남성  158912  124486  2019-11

In [32]:
# 국적코드표 엑셀파일 불러오기
code_master = pd.read_excel('./datasalon-master/datasalon-master/02_개정판/2_Data_Analysis_Basic/files/sample_codemaster.xlsx')
code_master

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [33]:
# sample_1 데이터에 통합하기
## 설명 : left표는 sample_1 이고 right표는 code_master이다. how = 'left'는 left표를 기준으로 삼겠다는 것이다.
## 설명 : left_on은 왼쪽 테이블의 기준 column은 국적코드 이다. right_on도 동일하다. 
## NaN은 아마 A31에 대한 국적명이 없나보다.
sample_1_code = pd.merge(left = sample_1, right = code_master, how = 'left', left_on = '국적코드', right_on = '국적코드')
sample_1_code

  국적코드  성별    입국객수    전년동기     기준년월  국적명
0  A01  남성  106320   85815  2019-11   일본
1  A01  여성  191436  125241  2019-11   일본
2  A31  남성     319     299  2019-11  NaN
3  A31  여성      42      54  2019-11  NaN
4  A18  남성  158912  124486  2019-11   중국
5  A18  여성  232943  163466  2019-11   중국

데이터 통합 - 아래로 통합(append)
- 실무에서는 효율성을 위해 데이터를 월별 파일로 관리하는 경우가 많다. 
- 월별 데이터 분석을 하기 위해서는 데이터를 먼저 통합해야 한다. (아래로 통합해야겠지?) ; 이걸 모르면 복붙하는 수고를 범할지도 ㅎㅎ ....

In [35]:
# 데이터를 아래로 통합하기 위해서는 칼럼 순서가 동일해야 한다. 
sample_2 = pd.read_excel('./datasalon-master/datasalon-master/02_개정판/2_Data_Analysis_Basic/files/sample_2.xlsx',
                         header = 1, skipfooter = 2, usecols = 'A:D')
sample_2['기준년월'] = '2019-11'
sample_2_code = pd.merge(left = sample_2, right = code_master, how = 'left', left_on = '국적코드', right_on = '국적코드')
sample_2_code
# 아래로 통합하기 위해서는 sample_1_code와 sample_2_code의 칼럼 순서가 동일해야 한다. (동일함)

  국적코드  성별    입국객수    전년동기     기준년월 국적명
0  A01  남성   92556   75992  2019-11  일본
1  A01  여성  163737  115397  2019-11  일본
2  A18  남성  155540  129908  2019-11  중국
3  A18  여성  249023  191236  2019-11  중국

In [36]:
sample = sample_1_code.append(sample_2_code, ignore_index = True) #index 를 ignore한다는 것은 기존의 index를 반영하는 것이므로 True로 해줘야 한다.
sample

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_23432\730864228.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sample = sample_1_code.append(sample_2_code, ignore_index = True)

  국적코드  성별    입국객수    전년동기     기준년월  국적명
0  A01  남성  106320   85815  2019-11   일본
1  A01  여성  191436  125241  2019-11   일본
2  A31  남성     319     299  2019-11  NaN
3  A31  여성      42      54  2019-11  NaN
4  A18  남성  158912  124486  2019-11   중국
5  A18  여성  232943  163466  2019-11   중국
6  A01  남성   92556   75992  2019-11   일본
7  A01  여성  163737  115397  2019-11   일본
8  A18  남성  155540  129908  2019-11   중국
9  A18  여성  249023  191236  2019-11   중국

In [44]:
# 데이터 저장하기
sample.to_excel('./datasalon-master/datasalon-master/02_개정판/2_Data_Analysis_Basic/files/sample_index_false.xlsx', index =False)

sample_index_false = pd.read_excel('./datasalon-master/datasalon-master/02_개정판/2_Data_Analysis_Basic/files/sample_index_false.xlsx')

sample_index_false

  국적코드  성별    입국객수    전년동기     기준년월  국적명
0  A01  남성  106320   85815  2019-11   일본
1  A01  여성  191436  125241  2019-11   일본
2  A31  남성     319     299  2019-11  NaN
3  A31  여성      42      54  2019-11  NaN
4  A18  남성  158912  124486  2019-11   중국
5  A18  여성  232943  163466  2019-11   중국
6  A01  남성   92556   75992  2019-11   일본
7  A01  여성  163737  115397  2019-11   일본
8  A18  남성  155540  129908  2019-11   중국
9  A18  여성  249023  191236  2019-11   중국